{
  "include": [
    "view/article/Scope.html"
  ],
  "heading": "Overview of To-be Functionalities",
  "authors": {
    "CP": {
      "href": "mailto:cedricpn@hku.hk",
      "name": "Cedric Poon",
      "icon":"chess rook"
    },
    "KC": {
      "href": "mailto:u3532369@hku.hk",
      "name": "Karen Chiu",
      "icon":"heart"
    }
  },
  "comments": [
    {
      "author": "CP",
      "timestamp": "Today at 02:45PM",
      "context": "<p>The Application can be essentially characterized to support 2 major aspects<ul class='ui list'><li><u>Question and Answer (Q&A) Approach</u><p>Enables users (students) to rise academic questions about their studying courses and interested aspects</p></li><li><u>Experience Sharing (Exp) Approach</u><p>Allows senior students to share what they have learnt from previous or current courses to others, in order to encourage peer learning.</p></li></ul></p>",
      "thumbsUp": "<span class='thumbNo'>-</span>",
      "thumbsDown": "<span class='thumbNo'>-</span>",
      "comments": [
        {
          "author": "KC",
          "timestamp": "Today at 04:00PM",
          "context": "<p>As <a><b>@cedricpn</b></a> mentioned, those two aspects will be focused in designing the features of the App.</p>",
          "thumbsUp": "<span class='thumbNo'>-</span>",
          "thumbsDown": "<span class='thumbNo'>-</span>"
        }
      ]
    },
    {
      "author": "CP",
      "timestamp": "Today at 04:10PM",
      "context": "<p>In order to have a peek on what <span class='ui teal mini icon basic label'><i class='icon graduation cap'></i>HKU Fellows</span> provides, possible features will be shared below. <i>Click on it for more details.</i></p>",
      "thumbsUp": "<span class='thumbNo'>-</span>",
      "thumbsDown": "<span class='thumbNo'>-</span>"
    },
    {
      "author": "CP",
      "timestamp": "Today at 05:12PM",
      "context": "<div class='ui accordion'><div class='title'><i class='dropdown icon'></i>Push Notification</div><div class='content'><p class='transition hidden'>Present HKU Moodle Forum has a sole way to notify students and teaching staff for incoming new feeds including new posts and new replies, which is via HKU email. It is considered to be passive as email protocol and relative applications are required for users to receive instant circulars. Thus, a customizable push notification will work as an instant way to notify users.</p></div><div class='title'><i class='dropdown icon'></i>HKU Moodle Forum Crawler</div><div class='content'><p>To affiliate existing mode of peer learning in HKU Moodle, the Application provides seamless adoption to current HKU Moodle Forum for fundamental integration. Web crawling approach will be employed to view and create posts on HKU Moodle Forum via in-app actions, while providing similar user experience as the Application native posts.</p></div><div class='title'><i class='dropdown icon'></i>Anonymity</div><div class='content'><p>According to the conclusion drawn from <a href='http://orca.cf.ac.uk/60230/'>a study of anonymity and promoting connection in internal University online forums</a>, discussions on forums are encouraged with introduction of incognito among University students, allowing them to be less focused on self-manifestation. Therefore, providing anonymity as a choice in the Application will be beneficial for facilitating peer learning.</p></div><div class='title'><i class='dropdown icon'></i>Post Rating</div><div class='content'><p>To boost the motivation among students on answering others and sharing own thoughts and experience, rating system similar to Stack Overflow will be introduced to serve as systemic bonus.</p></div><div class='title'><i class='dropdown icon'></i>Post Similarity Detection</div><div class='content'><p>A hypothetical situation of multiple students asking similar or same questions may arise. This will create unwanted duplications of posts and downgrade user experience in the Application. In order to minimize the occurrence of above-mentioned scenario, post similarity detection will be presented.</p></div></div>",
      "thumbsUp": "<span class='thumbNo'>-</span>",
      "thumbsDown": "<span class='thumbNo'>-</span>"
    }
  ]
}
